Repository: AbdAlrhmanHassan/tourism_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appBarTitle
source: Explore Jordan
ar: استكشف الأردن

# aiBottomSheetTitle
source: What do you prefer in your visit?
ar: ما الذي تفضله في زيارتك؟

# aiBottomSheetHint
source: Enter your preference (e.g., sea, mountains...)
ar: أدخل ما تفضله (مثال: البحر، الجبال...)

# requiredField
source: This field is required
ar: هذا الحقل مطلوب

# invalidValue
source: This value cannot be used
ar: لا يمكن استخدام هذا القيمة

# exploreButton
source: Explore
ar: استكشاف

# noMatchSnackBar
source: No matching location found, please try again.
ar: لم يتم العثور على مكان مطابق، حاول مرة أخرى.

source: Show on Map
ar: عرض الموقع على الخريطة

# location_petra_name
source: Petra
ar: البتراء

# location_petra_city
source: Ma'an
ar: معان

# location_petra_description
source: An ancient city carved into the rock, considered one of the New Seven Wonders of the World. It was the capital of the Nabataeans and is known as the "Rose City" due to the color of its stones. Located in southern Jordan, it's one of the most visited tourist sites in the world.
ar: مدينة أثرية منحوتة في الصخر، تعتبر من عجائب الدنيا السبع الجديدة. كانت عاصمة للأنباط وتُعرف باسم "المدينة الوردية" نظراً للون صخورها المميز. تقع في جنوب الأردن وتعتبر من أبرز المواقع السياحية في العالم.

# location_deadSea_name
source: Dead Sea
ar: البحر الميت

# location_deadSea_city
source: Amman
ar: العاصمة عمان

# location_deadSea_description
source: The lowest point on Earth, known for its salty, mineral-rich waters that make floating effortless. It is believed to have been part of the biblical city of Sodom.
ar: أخفض نقطة على سطح الأرض، ويتميز بمياهه المالحة الغنية بالمعادن، التي تجعل السباحة فيها تجربة فريدة من نوعها. يُعتقد أن المنطقة كانت جزءاً من مدينة سدوم التوراتية.

# location_ajloun_name
source: Ajloun Castle
ar: قلعة عجلون

# location_ajloun_city
source: Ajloun
ar: عجلون

# location_ajloun_description
source: Ajloun Castle is a medieval Islamic fortress located in northwestern Jordan. It's one of the country’s most important historical landmarks and overlooks the Jordan Valley.
ar: قلعة عجلون هي قلعة إسلامية من القرون الوسطى تقع في شمال غرب الأردن. إنها واحدة من أهم المعالم التاريخية في البلاد وتطل على وادي الأردن.

# location_jerash_name
source: Jerash Ruins
ar: آثار جرش

# location_jerash_city
source: Jerash
ar: جرش

# location_jerash_description
source: An archaeological city featuring well-preserved Roman ruins. It’s one of the largest Roman cities in the Middle East, including the South Theater, the Oval Plaza, and magnificent Corinthian columns.
ar: مدينة أثرية تضم أطلالاً رومانية محفوظة بشكل جيد. تعتبر واحدة من أكبر المدن الرومانية القديمة، وتحتوي على المسرح الجنوبي، الساحة البيضاوية، وأعمدة كورنثية رائعة.

# location_wadiRum_name
source: Wadi Rum
ar: وادي رم

# location_wadiRum_city
source: Aqaba
ar: العقبة

# location_wadiRum_description
source: Wadi Rum, known as the Valley of the Moon, is a desert in southern Jordan famous for its dramatic landscapes. It features red sand dunes and towering rock formations, and has served as a filming location for several major movies.
ar: وادي رم، المعروف بوادي القمر، هو صحراء تقع في جنوب الأردن تتميز بجمالها الطبيعي وتضاريسها الخلابة. يُعرف الوادي برماله الحمراء وجباله الشاهقة، وقد كان موقعاً لتصوير العديد من الأفلام الشهيرة.

# location_amman_name
source: Amman
ar: عمان

# location_amman_city
source: Amman
ar: عمان

# location_amman_description
source: Amman is Jordan’s capital and most populous city, blending ancient ruins—like the Neolithic ‘Ain Ghazal site—with modern culture.
ar: عمان هي عاصمة الأردن وأكثر مدنه اكتظاظًا بالسكان، تجمع بين الآثار القديمة مثل موقع عين غزال الحجري الحديث والثقافة العصرية.

# location_aqaba_name
source: Aqaba
ar: العقبة

# location_aqaba_city
source: Aqaba
ar: العقبة

# location_aqaba_description
source: Aqaba on the Red Sea offers beach resorts, world‑class snorkeling over coral reefs, plus medieval Ayla ruins.
ar: تقدم العقبة على البحر الأحمر منتجعات شاطئية، غطس من الطراز العالمي فوق الشعاب المرجانية، بالإضافة إلى آثار مدينة أيلا medieval.

# location_madaba_name
source: Madaba
ar: مادبا

# location_madaba_city
source: Madaba
ar: مادبا

# location_madaba_description
source: Madaba is famed as the “City of Mosaics,” home to the 6th‑century Madaba Map—the oldest cartographic depiction of the Holy Land.
ar: تشتهر مادبا باسم «مدينة الفسيفساء»، وتحتضن خريطة مادبا من القرن السادس، أقدم خريطة جغرافية للأراضي المقدسة.

# location_mountNebo_name
source: Mount Nebo
ar: جبل نيبو

# location_mountNebo_city
source: Madaba
ar: مادبا

# location_mountNebo_description
source: Mount Nebo is the biblical site where Moses viewed the Promised Land before his death, featuring a memorial church and panoramic overlooks.
ar: جبل نيبو هو الموقع التوراتي الذي نظر منه موسى إلى الأرض الموعودة قبل وفاته، ويضم كنيسة تذكارية وإطلالات بانورامية.

# location_danaBiosphere_name
source: Dana Biosphere Reserve
ar: محمية ضانا

# location_danaBiosphere_city
source: Tafila
ar: الطفيلة

# location_danaBiosphere_description
source: The Dana Biosphere Reserve spans rugged highlands to desert, protecting over 800 plant species and offering hiking through dramatic canyons.
ar: تمتد محمية ضانا من المرتفعات الوعرة إلى الصحراء، وتحمي أكثر من 800 نوع نباتي وتوفر مسارات مشي في أودية مذهلة.

# location_ummQais_name
source: Umm Qais
ar: أم قيس

# location_ummQais_city
source: Irbid
ar: إربد

# location_ummQais_description
source: Umm Qais (ancient Gadara) overlooks the Sea of Galilee and is famed for its Hellenistic‑Roman ruins, including a theater and colonnaded streets.
ar: تطل أم قيس (غادارة القديمة) على بحر الجليل، وتشتهر بآثارها الهيلينية‑الرومانية، بما في ذلك المسرح والشوارع ذات الأعمدة.

# location_karakCastle_name
source: Karak Castle
ar: قلعة الكرك

# location_karakCastle_city
source: Karak
ar: الكرك

# location_karakCastle_description
source: Al‑Karak Castle is a 12th‑century Crusader fortress commanding views of the Dead Sea corridor, with massive walls and towers.
ar: تعد قلعة الكرك حصنًا صليبيًا من القرن الثاني عشر يطل على ممر البحر الميت، بجدران وأبراج ضخمة.

# location_shobakCastle_name
source: Shobak Castle
ar: قلعة شوبك

# location_shobakCastle_city
source: Ma'an
ar: معان

# location_shobakCastle_description
source: Shobak Castle (Crac de Montréal) was the first Crusader castle built in Transjordan (1115 AD), perched atop a hill with sweeping desert views.
ar: بنيت قلعة شوبك (Crac de Montréal) عام 1115 م، وتقع على تل مع إطلالات صحراوية شاسعة.

# location_wadiMujib_name
source: Wadi Mujib
ar: وادي الموجب

# location_wadiMujib_city
source: Karak
ar: الكرك

# location_wadiMujib_description
source: Wadi Mujib is a dramatic river gorge dropping 900 m to the Dead Sea, known for its adventurous Siq Trail canyon hike through waterfalls and pools.
ar: يعد وادي الموجب وادٍ دراميّ ينحدر 900 م نحو البحر الميت، ويشتهر بمسار السيق بين الشلالات والبرك.

# location_jordanMuseum_name
source: Jordan Museum
ar: متحف الأردن

# location_jordanMuseum_city
source: Amman
ar: عمان

# location_jordanMuseum_description
source: The Jordan Museum in Amman showcases the history and culture of Jordan from ancient to modern times.
ar: متحف الأردن في عمان يعرض تاريخ وثقافة الأردن من العصور القديمة إلى العصر الحديث.

# location_qasrKharana_name
source: Qasr Kharana
ar: قصر الحرانة

# location_qasrKharana_city
source: Tafila
ar: الطفيلة

# location_qasrKharana_description
source: Qasr Kharana is one of the Umayyad desert castles, located in eastern Jordan and is famous for its unique architectural design.
ar: قصر الحرانة هو أحد القصور الصحراوية الأموية، يقع في شرق الأردن ويتميز بتصميمه المعماري الفريد.

# aiViewTitle
source: Talk to AI
ar: تحدث مع الذكاء الاصطناعي

# aiWelcomeMessage
source: Welcome to the Explore Jordan app! Here you can explore the amazing tourist attractions in Jordan. If you have any questions or need assistance, feel free to ask.
ar: مرحبًا بك في تطبيق Explore Jordan! هنا يمكنك استكشاف الأماكن السياحية الرائعة في الأردن. إذا كان لديك أي أسئلة أو تحتاج إلى مساعدة، فلا تتردد في طرحها.

# askAQuestion
source: Ask
ar: اسأل

# profileViewTitle
source: Profile
ar: الملف الشخصي

source: Dark Mode
ar: الوضع الداكن

source: Language
ar: اللغة

# aboutApp
source: About the App
ar: حول التطبيق

# appVersion
source: Version
ar: الإصدار

# BottomNavigationBarHome
source: Home
ar: الصفحة الرئيسية

# BottomNavigationBarAi
source: AI
ar: الذكاء الاصطناعي

# BottomNavigationBarFaviority
source: Favorites
ar: المفضلة

# BottomNavigationBarSettings
source: Settings
ar: الإعدادات
